valid_simbols = ['ა','ბ','გ','დ','ე','ვ','ზ','თ','ი','კ','ლ','მ','ნ','ო','პ','ჟ','რ','ს','ტ','უ','ფ','ქ','ღ','ყ','შ','ჩ','ც','ძ','წ','ჭ','ხ','ჯ','ჰ']
word_list = [
    {"word": "ზუგდიდი", "quest": "ნაპოლეონის ნიღაბი ინახება სამ ქალაქში: ლონდონი, პარისი და ... გამოიცანით მესამე ქალაქი!"},
    {"word":"ნონა", "quest":"გამოიცანით მსოფლიოს მასშტაბით, მამაკაცებში პირველი გროსმეისტერი ქალის სახელი!"},
    {"word":"კაშკაშა", "quest":"რას ნიშნავს \"ხვიჩა\" მეგრულ ენაზე?"},
    {"word":"ფოტოსინთეზი", "quest":"მცენარეების მიერ მზის სინათლის ენერგიის გამოყენებით ორგანული ნივთიერებების სინთეზის პროცესი."},
    {"word":"მცხეთა", "quest":"რომელი ქალაქი იყო ძველი საქართველოს პირველი დედაქალაქი?"},
    {"word":"კოლხეთი", "quest":"რომელი ძველი სახელმწიფო მდებარეობდა შავი ზღვის აღმოსავლეთ სანაპიროზე და ცნობილი იყო ოქროთისხით?"},
    {"word":"ნილოსი", "quest":"რომელი მდინარე ითვლება ძველი ეგვიპტის ცივილიზაციის აკვნად?"},
    {"word":"ათენი", "quest":"რომელი ქალაქი იყო ძველი საბერძნეთის დემოკრატიის დაბადების ადგილი?"},
    {"word":"ფოტონი", "quest":"რა არის ელექტრომაგნიტური გამოსხივების უმცირესი ნაწილაკი?"},
    {"word":"დნმ", "quest":"რა არის ყველა ცოცხალი ორგანიზმის გენეტიკური ინფორმაციის მატარებელი მოლეკულა?"},
    {"word":"გალაქტიკა", "quest":"რას უწოდებენ ვარსკვლავების, გაზის, მტვრისა და ბნელი მატერიის უზარმაზარ სისტემას?"},
    {"word":"ვულკანი", "quest":"რა არის დედამიწის ქერქის ისეთი ნაპრალი, საიდანაც დედამიწის სიღრმიდან ლავა, ნაცარი და გაზები ამოდის?"},
    {"word":"მონალიზა", "quest":"დავინჩის ერთ-ერთი ყველაზე ცნობილი და მისტიური ნახატი მსოფლიოში?"},
    {"word":"ჰამლეტი", "quest":"რომელი შექსპირის ტრაგედია მოგვითხრობს დანიის პრინცის შურისძიების შესახებ?"},
    {"word":"ევერესტი", "quest":"დაასახელე მთა მაჰალანგურ-ჰიმალაის მთის სისტემაში, ნეპალისა და ჩინეთის საზღვარზე."}   
]
